Revit 2027 API
RoutingPreferenceManager.GetMEPPartId Method
 Gets a fitting or segment id of given routing preference group that meets the specified routing conditions.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId GetMEPPartId(
	RoutingPreferenceRuleGroupType groupType,
	RoutingConditions conditions
)
Public Function GetMEPPartId (
	groupType As RoutingPreferenceRuleGroupType,
	conditions As RoutingConditions
) As ElementId
public:
ElementId^ GetMEPPartId(
	RoutingPreferenceRuleGroupType groupType,
	RoutingConditions^ conditions
)
member GetMEPPartId :
        groupType : RoutingPreferenceRuleGroupType *
        conditions : RoutingConditions -> ElementId
Parameters
groupType RoutingPreferenceRuleGroupType
 The routing preference group
conditions RoutingConditions
 A set of routing conditions
Return Value
ElementId
 The Id of the fitting or segment that met the given routing conditions.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
RoutingPreferenceManager Class
Autodesk.Revit.DB Namespace